#!/usr/bin/env python
#!-*-coding:utf-8 -*-
#!@Time:2020/5/13 17:01
#!@Author: zyx
#!@File: .py
#数组的基本函数
import numpy as np

t = np.arange(6)
print(t)
# [0 1 2 3 4 5]

#返回输入数组以e、2为底的指数结果
print(np.exp(t))
# [  1.           2.71828183   7.3890561   20.08553692  54.59815003   148.4131591 ]
print(np.exp2(t))
# [ 1.  2.  4.  8. 16. 32.]

#返回数组元素的正弦、余弦、正切值
print(np.sin(t))
# [ 0.          0.84147098  0.90929743  0.14112001 -0.7568025  -0.95892427]
print(np.cos(t))
# [ 1.          0.54030231 -0.41614684 -0.9899925  -0.65364362  0.28366219]
print(np.tan(t))
# [ 0.          1.55740772 -2.18503986 -0.14254654  1.15782128 -3.38051501]

#两个数组相加、减、乘、除
t1 = np.arange(7,13)
print(t1)
# [ 7  8  9 10 11 12]
print(np.add(t,t1))
# [ 7  9 11 13 15 17]
print(np.subtract(t,t1))
# [-7 -7 -7 -7 -7 -7]
print(np.multiply(t,t1))
# [ 0  8 18 30 44 60]
print(np.divide(t,t1))
# [0.         0.125      0.22222222 0.3        0.36363636 0.41666667]


