#!/usr/bin/env python
#!-*-coding:utf-8 -*-
#!@Time:2020/5/10 16:53
#!@Author: zyx
#!@File: .py
#numpy索引和切片
import numpy as np

t1 = np.arange(24).reshape(4,6)
print(t1)
# [[ 0  1  2  3  4  5]
#  [ 6  7  8  9 10 11]
#  [12 13 14 15 16 17]
#  [18 19 20 21 22 23]]

#取单行数据
print("*"*40)
print(t1[2,:]) #print（t1[2]）
# [12 13 14 15 16 17]

#取连续地多行数据
print("*"*40)
print(t1[1:,:]) #print（t1[2,:]）
# [[ 6  7  8  9 10 11]
#  [12 13 14 15 16 17]
#  [18 19 20 21 22 23]]

#取不连续地多行数据
print("*"*40)
print(t1[[0,2],:]) #print(t1[[0,2]])
# [[ 0  1  2  3  4  5]
#  [12 13 14 15 16 17]]

#取单列
print("*"*40)
print(t1[:,0])
#[ 0  6 12 18]

#取连续列
print("*"*40)
print(t1[:,2:])
# [[ 2  3  4  5]
#  [ 8  9 10 11]
#  [14 15 16 17]
#  [20 21 22 23]]

#取不连续列
print("*"*40)
print(t1[:,[0,2,4]])
# [[ 0  2  4]
#  [ 6  8 10]
#  [12 14 16]
#  [18 20 22]]

#取行和列，取第3行，第四列
print("*"*40)
print(t1[3,5]) #23
print(type(t1)) #<class 'numpy.ndarray'>

#取多行和多列，取第2-4行，第4-6列
print("*"*40)
print(t1[1:4,3:6]) #行与列的交叉点
# [[ 9 10 11]
#  [15 16 17]
#  [21 22 23]]

#取多个不相邻的点，逗号前后一一对应
print("*"*40)
#选取出来的点是 （0,0） （2,1）
print(t1[[0,2],[0,1]])
#[ 0 13]
