#!/usr/bin/env python
#!-*-coding:utf-8 -*-
#!@Time:2020/5/12 22:10
#!@Author: zyx
#!@File: .py
#三元运算符  where函数 clip函数

t = np.arange(24).reshape((4,6))
print(t)
# [[ 0  1  2  3  4  5]
# #  [ 6  7  8  9 10 11]
# #  [12 13 14 15 16 17]
# #  [18 19 20 21 22 23]]

# np.where(t<12,3,4) -----where函数*三元运算
t1 = t
print(np.where(t1<12,3,4))
# [[3 3 3 3 3 3]
#  [3 3 3 3 3 3]
#  [4 4 4 4 4 4]
#  [4 4 4 4 4 4]]

# np.clip(7,15) -----裁减函数
t2 = t
print(t2.clip(7,15))
# [[ 7  7  7  7  7  7]
#  [ 7  7  8  9 10 11]
#  [12 13 14 15 15 15]
#  [15 15 15 15 15 15]]
